app/Controllers/Guru.php

    public function index()
    {
        $selectedInstansi = $this->request->getVar('inputDataGuru');

        $query = $this->UserModel->where('jabatan', 'Guru');
        if (!empty($selectedInstansi) && $selectedInstansi != 'Pilih Asal Sekolah') {
            $query = $query->where('instansi', $selectedInstansi);
        }

        $data['users'] = $query->findAll();
---
SELECT *
FROM `users`
WHERE `jabatan` = 'Guru'
SELECT *
FROM `users`
WHERE `jabatan` = 'Guru'
AND `instansi` = 'Hall Sparks'

            'ajar'                  => $this->request->getPost('ajar'),
            'majar'                 => $this->request->getPost('majar')
        ];
        $this->UserModel->insert($data);
---
INSERT INTO `users` (`nik`, `email`, `nama`, `slug`, `jk`, `tanggal_lahir`, `tempat_lahir`, `password`, `npwp`, `nip`, `Agama`, `nuptk`, `ukg`, `hp`, `pend_terakhir`, `jurusan`, `jabatan`, `golongan`, `status`, `alamat`, `kec`, `kota`, `provinsi`, `komp_keahlian`, `instansi`, `npsn`, `ajar`, `majar`, `created_at`, `updated_at`) VALUES ('', '', '', '', 'L', '', '', '$2y$10$9X9LGFD7T6.ES03L8ZDAve2pEFbkWBLcEyZqR1PRYd96vb27ci9L2', '', '', '', '', '', '', '', '', 'Guru', 'iia', 'guru', '', '', '', '', '', '', '', '10', '', '2023-08-13 14:02:45', '2023-08-13 14:02:45')

    public function edit($id)
    {
        $data['guru'] = $this->UserModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '22'

            'majar'                 => $this->request->getPost('majar')
        ];

        $this->UserModel->update($id, $data);
---
UPDATE `users` SET `nik` = 'Coby Willis', `email` = 'qajyvypa@mailinator.com', `nama` = 'Graiden Herring', `slug` = 'Ashton Abbott', `jk` = 'P', `tanggal_lahir` = '2009-04-18', `tempat_lahir` = 'Fredericka Phillips', `password` = '$2y$10$QLy6wXiMuRRnS.W7RuFYXO0yEKNTCCdC5Dg1yVUZ9TVZyhyS5gOWu', `npwp` = '16', `nip` = '70', `Agama` = 'Ria Blake', `nuptk` = 'Hillary Hancock', `ukg` = 'Hasad Mcneil', `hp` = '71', `pend_terakhir` = 'Ian King', `jurusan` = 'Rinah Graham', `jabatan` = 'Fritz Arnold', `golongan` = 'iic', `status` = 'guru', `alamat` = 'Dylan Adams', `kec` = 'Maryam Saunders', `kota` = 'Coby Willis', `provinsi` = 'Jacob Faulkner', `komp_keahlian` = 'Quinn Cain', `instansi` = 'Daphne Anderson', `npsn` = '500', `ajar` = '12', `majar` = 'Barclay Holman'
WHERE `users`.`id` IN ('22')

    public function destroy($id)
    {
        $this->UserModel->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('19')